<img src='https://blog.kakaocdn.net/dn/zy1Or/btqM39h0uLB/fHnntePsHiwAIFStdqGsLk/img.png' width=300 align="left"/>

# 판다스

## 4.데이터프레임 집계

- 상세 데이터가 아닌 집계된 데이터에 대한 분석을 자주 요구하니 익숙해져야 할 내용입니다.
- sum(), mean(), max(), min(), count() 메소드를 사용해 지정한 열 또는 열들을 기준으로 집계합니다.
- 평균을 구하는 메소드가 avg()가 아닌 mean() 임을 주의하기 바랍니다.

In [ ]:
# 라이브러리 불러오기
import pandas as pd

* Attrition 데이터 불러오기

**[Attrition 데이터 셋 정보]**

|	구분	|	변수 명	|	내용	|	type	|	비고	|
|	----	|	----	|	----	|	----	|	----	|
|	**Target**	|	**Attrition**	|	이직여부, Yes , No	|	범주	| 1- 이직, 0- 잔류		|
|	feature	|	Age	|	나이	|	숫자	|		|
|	feature	|	DistanceFromHome	|	집-직장 거리	|	숫자	|	마일	|
|	feature	|	EmployNumber	|	사번	|	숫자	| 	|
|	feature	|	Gender	|	성별	|	범주	| Male, Female		|
|	feature	|	JobSatisfaction	|	직무 만족도	|	범주	|	1 Low, 2 Medium, 3 High, 4 Very High	|
|	feature	|	MaritalStatus	|	결혼상태	|	범주	| Single, Married, Divorced		|
|	feature	|	MonthlyIncome	|	월급	|	숫자	| 달러	|
|	feature	|	OverTime	|	야근여부	|	범주	|	Yes, No	|
|	feature	|	PercentSalaryHike	|	전년대비 급여인상율	|	숫자	|	%	|
|	feature	|	TotalWorkingYears	|	총 경력 연수	|	숫자	|		|

In [ ]:
# 데이터 읽어오기
path = 'https://raw.githubusercontent.com/DA4BAM/dataset/master/Attrition_simple2.CSV'
data = pd.read_csv(path)

# 상위 5개 확인
data.head(5)

,Attrition,Age,DistanceFromHome,EmployeeNumber,Gender,JobSatisfaction,MaritalStatus,MonthlyIncome,OverTime,PercentSalaryHike,TotalWorkingYears
0,0,33,7,817,Male,3,Married,11691,No,11,14
1,0,35,18,1412,Male,4,Single,9362,No,11,10
2,0,42,6,1911,Male,1,Married,13348,No,13,18
3,0,46,2,1204,Female,1,Married,17048,No,23,28
4,1,22,4,593,Male,3,Single,3894,No,16,4

### 4.1 열 하나 집계

- 우선 특정 열의 값 합은 다음과 같이 구할 수 있습니다.

In [ ]:
# MonthlyIncome 합계
data['MonthlyIncome'].sum()

7798045

**1) 집계하기**

- 만일 **MaritalStatus (Single, Married, Divorced) 별로 합을 구하고자 한다면 다음과 같이 합니다.
- **as_index=True**를 설정(기본값)하면 집계 기준이 되는 열이 인덱스 열이 됩니다.
  집계 결과가 data 열만 가지니 **시리즈**가 됩니다.
- **as_index=False**를 설정하면 행 번호를 기반으로 한 정수 값이 인덱스로 설정됩니다.

In [ ]:
# MaritalStatus 별 MonthlyIncome 합계 --> 데이터프레임
# as_index=False 행 번호를 기반으로 한 정수 값이 인덱스
data.groupby('MaritalStatus', as_index=False)['MonthlyIncome'].sum()

  MaritalStatus  MonthlyIncome
0      Divorced        1770653
1       Married        3770319
2        Single        2257073

In [ ]:
# MaritalStatus 별 MonthlyIncome 합계 --> 시리즈
# as_index=True를 설정(기본값)하면 집계 기준이 되는 열이 인덱스
data.groupby('MaritalStatus', as_index=True)['MonthlyIncome'].sum()

MaritalStatus
Divorced    1770653
Married     3770319
Single      2257073
Name: MonthlyIncome, dtype: int64

In [ ]:
# MaritalStatus 별 MonthlyIncome 합계 --> 데이터프레임
data.groupby('MaritalStatus', as_index=True)[['MonthlyIncome']].sum()

               MonthlyIncome
MaritalStatus
Divorced             1770653
Married              3770319
Single               2257073

### 4.2 여러 열 집계

- 여러 열에 대한 집계를 같이 할 수 있습니다.
- **[ ['feature1', 'feature2'] ].sum()** 형태와 같이 집계 대상 열을 리스트로 지정합니다.

In [ ]:
# 'MaritalStatus'별 'Age','MonthlyIncome' 평균 조회
data_mean = data.groupby('MaritalStatus', as_index=False)[['Age','MonthlyIncome']].mean()

# 확인
data_mean

  MaritalStatus        Age  MonthlyIncome
0      Divorced  37.522727    6707.018939
1       Married  37.704380    6880.144161
2        Single  35.460938    5877.794271

- sum() 메소드 앞에 아무 열도 지정하지 않으면 **기준열 이외의 모든 열에 대한 집계**가 수행됩니다.

In [ ]:
# 'MaritalStatus' 별 모든 열 집계
data_sum = data.groupby('MaritalStatus', as_index=False).sum()

# 확인
data_sum

,MaritalStatus,Attrition,Age,DistanceFromHome,EmployeeNumber,JobSatisfaction,MonthlyIncome,PercentSalaryHike,TotalWorkingYears
0,Divorced,23,9906,2404,266305,716,1770653,3958,3106
1,Married,69,20662,5295,584446,1468,3770319,8431,6470
2,Single,103,13617,3374,387862,1065,2257073,5852,3975

- **by=['feature1', 'feature2']** 과 같이 집계 기준 열을 여럿 설정할 수도 있습니다.

In [ ]:
# 'JobSatisfaction', 'Attrition'별 'Age','MonthlyIncome' 평균 조회
data_mean = data.groupby(['JobSatisfaction', 'Attrition'], as_index=False)[['Age','MonthlyIncome']].mean()

# 확인
data_mean

   JobSatisfaction  Attrition        Age  MonthlyIncome
0                1          0  38.434555    7373.963351
1                1          1  33.211538    5074.923077
2                2          0  37.243386    6674.380952
3                2          1  32.918919    4839.135135
4                3          0  37.857627    6794.457627
5                3          1  33.440678    4430.254237
6                4          0  37.138037    6716.030675
7                4          1  34.297872    4894.468085

<img src='https://raw.githubusercontent.com/jangrae/img/master/practice_01.png' width=120 align="left"/>

[문1] pandas 라이브러리를 pd 별칭을 주어 불러오세요.

In [ ]:
# 라이브러리 불러오기
import pandas as pd

[문2]  아래 주어진 경로의 파일에서 데이터를 읽어와 데이터프레임 temp 만들어 보세요.

- 파일 경로: https://raw.githubusercontent.com/DA4BAM/dataset/master/Carseats.csv

|	변수명	|	설명	|	구분	|
|	----	|	----	|	----	|
|	Sales 	|	 각 지역 판매량(단위 : 1000개)	|	Target	|
|	CompPrice 	|	지역별 경쟁사 판매가격(달러)	|	feature	|
|	Advertising 	|	 각 지역, 회사의 광고 예산(단위 : 1000달러)	|	feature|
|	Income 	|	 지역 주민 평균소득(단위 : 1000달러)	|	feature	|
|	Population 	|	 지역 인구수(단위 : 1000명)	|	feature	|
|	Price 	|	 자사 지역별 판매가격(달러)	|	feature	|
|	ShelveLoc 	|	 진열상태	|	feature	|
|	Age 	|	 지역 인구의 평균 연령	|	feature	|
|	US 	|	 매장이 미국에 있는지 여부	|	feature	|
|	Urban 	|	 매장이 도시에 있는지 여부	|	feature	|
|	Education 	|	 평균학력수준(범주 : 11~17)	|	feature	|

In [ ]:
# 데이터 읽어오기
path = 'https://raw.githubusercontent.com/DA4BAM/dataset/master/Carseats.csv'
temp = pd.read_csv(path)

# 상위 5개 확인
temp.head(5)

,Sales,CompPrice,Income,Advertising,Population,Price,ShelveLoc,Age,Education,Urban,US
0,9.50,138,73,11,276,120,Bad,42,17,Yes,Yes
1,11.22,111,48,16,260,83,Good,65,10,Yes,Yes
2,10.06,113,35,10,269,80,Medium,59,12,Yes,Yes
3,7.40,117,100,4,466,97,Medium,55,14,Yes,Yes
4,4.15,141,64,3,340,128,Bad,38,13,Yes,No

[문3]  진열상태(ShelveLoc) 별 평균 판매량(Sales)을 구해 봅시다.

In [ ]:
# 인덱스는 행 번호를 기반으로 설정
temp.groupby('ShelveLoc', as_index = False)['Sales'].mean()

  ShelveLoc      Sales
0       Bad   5.522917
1      Good  10.214000
2    Medium   7.306575

[문4]  진열상태(ShelveLoc) 별, 미국여부(US)별 평균 판매량(Sales), 평균 광고비(Advertising)를  구해 봅시다.

In [ ]:
# 인덱스는 행 번호를 기반으로 설정
temp.groupby(['ShelveLoc','US'], as_index = False)[['Sales', 'Advertising']].mean()

  ShelveLoc   US      Sales  Advertising
0       Bad   No   5.286765     0.764706
1       Bad  Yes   5.652419     9.209677
2      Good   No   9.150000     0.041667
3      Good  Yes  10.632623    10.229508
4    Medium   No   6.780000     0.535714
5    Medium  Yes   7.634222    10.274074